Output from `terraform plan`
```
  # module.replay-pipeline["dps-basm"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "step-function-log-group" {
        id                = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-dps-dps-basm-production"
        name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-dps-dps-basm-production"
      ~ tags              = {
            "Domain"         = "dps-basm"
          ~ "Jira"           = "main" -> "DPR2-1857"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
            "name"           = "log-group-dpr-replay-pipeline-dps-dps-basm-production"
        }
      ~ tags_all          = {
          ~ "Jira"           = "main" -> "DPR2-1857"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.replay-pipeline["dps-calc-rel-date"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "step-function-log-group" {
        id                = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-dps-dps-calc-rel-date-production"
        name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-dps-dps-calc-rel-date-production"
      ~ tags              = {
            "Domain"         = "dps-calc-rel-date"
          ~ "Jira"           = "main" -> "DPR2-1857"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
            "name"           = "log-group-dpr-replay-pipeline-dps-dps-calc-rel-date-production"
        }
      ~ tags_all          = {
          ~ "Jira"           = "main" -> "DPR2-1857"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.replay-pipeline["dps-case-notes"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "step-function-log-group" {
        id                = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-dps-dps-case-notes-production"
        name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-dps-dps-case-notes-production"
      ~ tags              = {
            "Domain"         = "dps-case-notes"
          ~ "Jira"           = "main" -> "DPR2-1857"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
            "name"           = "log-group-dpr-replay-pipeline-dps-dps-case-notes-production"
        }
      ~ tags_all          = {
          ~ "Jira"           = "main" -> "DPR2-1857"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.replay-pipeline["dps-csip"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "step-function-log-group" {
        id                = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-dps-dps-csip-production"
        name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-dps-dps-csip-production"
      ~ tags              = {
            "Domain"         = "dps-csip"
          ~ "Jira"           = "main" -> "DPR2-1857"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
            "name"           = "log-group-dpr-replay-pipeline-dps-dps-csip-production"
        }
      ~ tags_all          = {
          ~ "Jira"           = "main" -> "DPR2-1857"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.replay-pipeline["dps-inc-reporting"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "step-function-log-group" {
        id                = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-dps-dps-inc-reporting-production"
        name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-dps-dps-inc-reporting-production"
      ~ tags              = {
            "Domain"         = "dps-inc-reporting"
          ~ "Jira"           = "main" -> "DPR2-1857"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
            "name"           = "log-group-dpr-replay-pipeline-dps-dps-inc-reporting-production"
        }
      ~ tags_all          = {
          ~ "Jira"           = "main" -> "DPR2-1857"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.replay-pipeline["dps-locations"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "step-function-log-group" {
        id                = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-dps-dps-locations-production"
        name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-dps-dps-locations-production"
      ~ tags              = {
            "Domain"         = "dps-locations"
          ~ "Jira"           = "main" -> "DPR2-1857"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
            "name"           = "log-group-dpr-replay-pipeline-dps-dps-locations-production"
        }
      ~ tags_all          = {
          ~ "Jira"           = "main" -> "DPR2-1857"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.replay-pipeline["establishments"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "step-function-log-group" {
        id                = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-establishments-production"
        name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-establishments-production"
      ~ tags              = {
            "Domain"         = "establishments"
          ~ "Jira"           = "main" -> "DPR2-1857"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
            "name"           = "log-group-dpr-replay-pipeline-nomis-establishments-production"
        }
      ~ tags_all          = {
          ~ "Jira"           = "main" -> "DPR2-1857"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.replay-pipeline["finance"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be destroyed
  # (because module.replay-pipeline["finance"].module.replay_pipeline is not in configuration)
  - resource "aws_cloudwatch_log_group" "step-function-log-group" {
      - arn               = "arn:aws:logs:eu-west-2:004723187462:log-group:/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-finance-production" -> null
      - id                = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-finance-production" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-finance-production" -> null
      - retention_in_days = 7 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "Domain"         = "finance"
          - "Jira"           = "main"
          - "Resource_Type"  = "Step Function"
          - "Service_Bundle" = "true"
          - "name"           = "log-group-dpr-replay-pipeline-nomis-finance-production"
        } -> null
      - tags_all          = {
          - "Domain"         = "finance"
          - "Jira"           = "main"
          - "Resource_Type"  = "Step Function"
          - "Service_Bundle" = "true"
          - "name"           = "log-group-dpr-replay-pipeline-nomis-finance-production"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.replay-pipeline["finance"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be destroyed
  # (because module.replay-pipeline["finance"].module.replay_pipeline is not in configuration)
  - resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      - arn                       = "arn:aws:states:eu-west-2:004723187462:stateMachine:dpr-replay-pipeline-nomis-finance-production" -> null
      - creation_date             = "2024-09-06T15:00:36Z" -> null
      - definition                = jsonencode(
            {
              - Comment = "Replay Pipeline Step Function"
              - StartAt = "Deactivate Archive Trigger"
              - States  = {
                  - "Archive Remaining Raw Files"                          = {
                      - Next       = "Copy Archived Data to Raw Bucket"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                        = "finance"
                              - "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-production"
                              - "--dpr.datastorage.retry.maxAttempts"     = "10"
                              - "--dpr.datastorage.retry.maxWaitMillis"   = "10000"
                              - "--dpr.datastorage.retry.minWaitMillis"   = "1000"
                              - "--dpr.file.transfer.delete.copied.files" = "true"
                              - "--dpr.file.transfer.destination.bucket"  = "dpr-raw-archive-production"
                              - "--dpr.file.transfer.source.bucket"       = "dpr-raw-zone-production"
                            }
                          - JobName   = "dpr-s3-file-transfer-job-production"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Check All Files Have Been Replayed"                   = {
                      - Next       = "Empty Raw Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.allowed.s3.file.regex"               = "\\d+-\\d+.parquet"
                              - "--dpr.orchestration.max.attempts"          = "8"
                              - "--dpr.orchestration.wait.interval.seconds" = "900"
                            }
                          - JobName   = "pending-files-check-finance-production"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Check All Pending Files Have Been Processed"          = {
                      - Next       = "Stop Glue Streaming Job"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.orchestration.max.attempts"          = "8"
                              - "--dpr.orchestration.wait.interval.seconds" = "900"
                            }
                          - JobName   = "pending-files-check-finance-production"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Copy Archived Data to Raw Bucket"                     = {
                      - Next       = "Start Glue Batch Job"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                            = "finance"
                              - "--dpr.config.s3.bucket"                      = "dpr-glue-jobs-production"
                              - "--dpr.datastorage.retry.maxAttempts"         = "10"
                              - "--dpr.datastorage.retry.maxWaitMillis"       = "10000"
                              - "--dpr.datastorage.retry.minWaitMillis"       = "1000"
                              - "--dpr.file.transfer.delete.copied.files"     = "false"
                              - "--dpr.file.transfer.destination.bucket"      = "dpr-raw-zone-production"
                              - "--dpr.file.transfer.retention.period.amount" = "0"
                              - "--dpr.file.transfer.source.bucket"           = "dpr-raw-archive-production"
                            }
                          - JobName   = "dpr-s3-file-transfer-job-production"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Copy Curated Data to Temp-Reload Bucket"              = {
                      - Next       = "Switch Hive Tables for Prisons to Temp-Reload Bucket"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                        = "finance"
                              - "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-production"
                              - "--dpr.datastorage.retry.maxAttempts"     = "10"
                              - "--dpr.datastorage.retry.maxWaitMillis"   = "10000"
                              - "--dpr.datastorage.retry.minWaitMillis"   = "1000"
                              - "--dpr.file.transfer.delete.copied.files" = "false"
                              - "--dpr.file.transfer.destination.bucket"  = "dpr-temp-reload-production"
                              - "--dpr.file.transfer.source.bucket"       = "dpr-curated-zone-production"
                            }
                          - JobName   = "dpr-s3-file-transfer-job-production"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Deactivate Archive Trigger"                           = {
                      - Next       = "Stop Archive Job"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.glue.trigger.activate" = "false"
                              - "--dpr.glue.trigger.name"     = "dpr-archive-finance-production-trigger"
                            }
                          - JobName   = "dpr-activate-glue-trigger-job-production"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Empty Raw Data"                                       = {
                      - Next       = "Resume DMS Replication Task"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"            = "finance"
                              - "--dpr.file.deletion.buckets" = "dpr-raw-zone-production"
                            }
                          - JobName   = "dpr-s3-data-deletion-job-production"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Empty Structured and Curated Data"                    = {
                      - Next       = "Archive Remaining Raw Files"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"            = "finance"
                              - "--dpr.file.deletion.buckets" = "dpr-structured-zone-production,dpr-curated-zone-production"
                            }
                          - JobName   = "dpr-s3-data-deletion-job-production"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Empty Temp Reload Bucket Data"                        = {
                      - End        = true
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"            = "finance"
                              - "--dpr.file.deletion.buckets" = "dpr-temp-reload-production"
                            }
                          - JobName   = "dpr-s3-data-deletion-job-production"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Prepare Temp Reload Bucket Data"                      = {
                      - Next       = "Copy Curated Data to Temp-Reload Bucket"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"            = "finance"
                              - "--dpr.file.deletion.buckets" = "dpr-temp-reload-production"
                            }
                          - JobName   = "dpr-s3-data-deletion-job-production"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Reactivate Archive Trigger"                           = {
                      - Next       = "Empty Temp Reload Bucket Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.glue.trigger.activate" = "true"
                              - "--dpr.glue.trigger.name"     = "dpr-archive-finance-production-trigger"
                            }
                          - JobName   = "dpr-activate-glue-trigger-job-production"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Resume DMS Replication Task"                          = {
                      - Next       = "Switch Hive Tables for Prisons to Curated"
                      - Parameters = {
                          - ReplicationTaskArn       = "arn:aws:dms:eu-west-2:004723187462:task:THZTYOR64VFHZIVYA5RNW7P564"
                          - StartReplicationTaskType = "resume-processing"
                        }
                      - Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      - Type       = "Task"
                    }
                  - "Run Compaction Job on Curated Zone"                   = {
                      - Next       = "Run Vacuum Job on Curated Zone"
                      - Parameters = {
                          - Arguments       = {
                              - "--dpr.config.key"            = "finance"
                              - "--dpr.config.s3.bucket"      = "dpr-glue-jobs-production"
                              - "--dpr.maintenance.root.path" = "s3://dpr-curated-zone-production/nomis/"
                            }
                          - JobName         = "dpr-maintenance-compaction-production"
                          - NumberOfWorkers = 10
                          - WorkerType      = "G.1X"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Run Compaction Job on Structured Zone"                = {
                      - Next       = "Run Vacuum Job on Structured Zone"
                      - Parameters = {
                          - Arguments       = {
                              - "--dpr.config.key"            = "finance"
                              - "--dpr.config.s3.bucket"      = "dpr-glue-jobs-production"
                              - "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-production/nomis/"
                            }
                          - JobName         = "dpr-maintenance-compaction-production"
                          - NumberOfWorkers = 10
                          - WorkerType      = "G.1X"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Run Vacuum Job on Curated Zone"                       = {
                      - Next       = "Start Glue Streaming Job"
                      - Parameters = {
                          - Arguments       = {
                              - "--dpr.config.key"            = "finance"
                              - "--dpr.config.s3.bucket"      = "dpr-glue-jobs-production"
                              - "--dpr.maintenance.root.path" = "s3://dpr-curated-zone-production/nomis/"
                            }
                          - JobName         = "dpr-maintenance-retention-production"
                          - NumberOfWorkers = 2
                          - WorkerType      = "G.1X"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Run Vacuum Job on Structured Zone"                    = {
                      - Next       = "Run Compaction Job on Curated Zone"
                      - Parameters = {
                          - Arguments       = {
                              - "--dpr.config.key"            = "finance"
                              - "--dpr.config.s3.bucket"      = "dpr-glue-jobs-production"
                              - "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-production/nomis/"
                            }
                          - JobName         = "dpr-maintenance-retention-production"
                          - NumberOfWorkers = 2
                          - WorkerType      = "G.1X"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Start Glue Batch Job"                                 = {
                      - Next       = "Run Compaction Job on Structured Zone"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.batch.load.fileglobpattern" = "{part-*.snappy.parquet,LOAD*parquet}"
                              - "--dpr.config.key"                 = "finance"
                              - "--dpr.config.s3.bucket"           = "dpr-glue-jobs-production"
                            }
                          - JobName   = "dpr-batch-finance-production"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Start Glue Streaming Job"                             = {
                      - Next       = "Check All Files Have Been Replayed"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.clean.cdc.checkpoint" = "true"
                              - "--dpr.config.key"           = "finance"
                              - "--dpr.config.s3.bucket"     = "dpr-glue-jobs-production"
                            }
                          - JobName   = "dpr-cdc-finance-production"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun"
                      - Type       = "Task"
                    }
                  - "Stop Archive Job"                                     = {
                      - Next       = "Stop DMS Replication Task"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.stop.glue.instance.job.name" = "dpr-archive-finance-production"
                            }
                          - JobName   = "dpr-stop-glue-instance-job-production"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Stop DMS Replication Task"                            = {
                      - Next       = "Check All Pending Files Have Been Processed"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.dms.replication.task.id" = "dpr-dms-nomis-oracle-s3-finance-task-production"
                            }
                          - JobName   = "dpr-stop-dms-task-job-production"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Stop Glue Streaming Job"                              = {
                      - Next       = "Prepare Temp Reload Bucket Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.stop.glue.instance.job.name" = "dpr-cdc-finance-production"
                            }
                          - JobName   = "dpr-stop-glue-instance-job-production"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Switch Hive Tables for Prisons to Curated"            = {
                      - Next       = "Reactivate Archive Trigger"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                         = "finance"
                              - "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-curated-zone-production"
                            }
                          - JobName   = "dpr-switch-prisons-data-source-production"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      - Next       = "Empty Structured and Curated Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                         = "finance"
                              - "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-temp-reload-production"
                            }
                          - JobName   = "dpr-switch-prisons-data-source-production"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                }
            }
        ) -> null
      - id                        = "arn:aws:states:eu-west-2:004723187462:stateMachine:dpr-replay-pipeline-nomis-finance-production" -> null
      - name                      = "dpr-replay-pipeline-nomis-finance-production" -> null
      - publish                   = false -> null
      - revision_id               = "58b9f961-c2f5-45ed-882e-76a1e0594976" -> null
      - role_arn                  = "arn:aws:iam::004723187462:role/dpr-step-function-execution-role" -> null
      - status                    = "ACTIVE" -> null
      - tags                      = {
          - "Domain"         = "finance"
          - "Jira"           = "main"
          - "Resource_Type"  = "Step Function"
          - "Service_Bundle" = "true"
        } -> null
      - tags_all                  = {
          - "Domain"         = "finance"
          - "Jira"           = "main"
          - "Resource_Type"  = "Step Function"
          - "Service_Bundle" = "true"
        } -> null
      - type                      = "STANDARD" -> null
        # (3 unchanged attributes hidden)

      - encryption_configuration {
          - kms_data_key_reuse_period_seconds = 0 -> null
          - type                              = "AWS_OWNED_KEY" -> null
            # (1 unchanged attribute hidden)
        }

      - logging_configuration {
          - include_execution_data = true -> null
          - level                  = "ERROR" -> null
          - log_destination        = "arn:aws:logs:eu-west-2:004723187462:log-group:/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-finance-production:*" -> null
        }

      - tracing_configuration {
          - enabled = true -> null
        }
    }

  # module.replay-pipeline["finance-txns"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be created
  + resource "aws_cloudwatch_log_group" "step-function-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-finance-txns-production"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "finance-txns"
          + "Jira"           = "DPR2-1857"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-nomis-finance-txns-production"
        }
      + tags_all          = {
          + "Domain"         = "finance-txns"
          + "Jira"           = "DPR2-1857"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-nomis-finance-txns-production"
        }
    }

  # module.replay-pipeline["finance-txns"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (known after apply)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-replay-pipeline-nomis-finance-txns-production"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = "arn:aws:iam::004723187462:role/dpr-step-function-execution-role"
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "finance-txns"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "finance-txns"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)

      + encryption_configuration (known after apply)

      + logging_configuration {
          + include_execution_data = true
          + level                  = "ERROR"
          + log_destination        = (known after apply)
        }

      + tracing_configuration {
          + enabled = true
        }
    }

  # module.replay-pipeline["gangs"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "step-function-log-group" {
        id                = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-gangs-production"
        name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-gangs-production"
      ~ tags              = {
            "Domain"         = "gangs"
          ~ "Jira"           = "main" -> "DPR2-1857"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
            "name"           = "log-group-dpr-replay-pipeline-nomis-gangs-production"
        }
      ~ tags_all          = {
          ~ "Jira"           = "main" -> "DPR2-1857"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.replay-pipeline["hdc"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "step-function-log-group" {
        id                = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-hdc-production"
        name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-hdc-production"
      ~ tags              = {
            "Domain"         = "hdc"
          ~ "Jira"           = "main" -> "DPR2-1857"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
            "name"           = "log-group-dpr-replay-pipeline-nomis-hdc-production"
        }
      ~ tags_all          = {
          ~ "Jira"           = "main" -> "DPR2-1857"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.replay-pipeline["incidents"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "step-function-log-group" {
        id                = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-incidents-production"
        name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-incidents-production"
      ~ tags              = {
            "Domain"         = "incidents"
          ~ "Jira"           = "main" -> "DPR2-1857"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
            "name"           = "log-group-dpr-replay-pipeline-nomis-incidents-production"
        }
      ~ tags_all          = {
          ~ "Jira"           = "main" -> "DPR2-1857"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.replay-pipeline["movements"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "step-function-log-group" {
        id                = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-movements-production"
        name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-movements-production"
      ~ tags              = {
            "Domain"         = "movements"
          ~ "Jira"           = "main" -> "DPR2-1857"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
            "name"           = "log-group-dpr-replay-pipeline-nomis-movements-production"
        }
      ~ tags_all          = {
          ~ "Jira"           = "main" -> "DPR2-1857"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.replay-pipeline["non-associations"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "step-function-log-group" {
        id                = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-non-associations-production"
        name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-non-associations-production"
      ~ tags              = {
            "Domain"         = "non-associations"
          ~ "Jira"           = "main" -> "DPR2-1857"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
            "name"           = "log-group-dpr-replay-pipeline-nomis-non-associations-production"
        }
      ~ tags_all          = {
          ~ "Jira"           = "main" -> "DPR2-1857"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.replay-pipeline["orders"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "step-function-log-group" {
        id                = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-orders-production"
        name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-orders-production"
      ~ tags              = {
            "Domain"         = "orders"
          ~ "Jira"           = "main" -> "DPR2-1857"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
            "name"           = "log-group-dpr-replay-pipeline-nomis-orders-production"
        }
      ~ tags_all          = {
          ~ "Jira"           = "main" -> "DPR2-1857"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.replay-pipeline["person"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "step-function-log-group" {
        id                = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-person-production"
        name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-person-production"
      ~ tags              = {
            "Domain"         = "person"
          ~ "Jira"           = "main" -> "DPR2-1857"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
            "name"           = "log-group-dpr-replay-pipeline-nomis-person-production"
        }
      ~ tags_all          = {
          ~ "Jira"           = "main" -> "DPR2-1857"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.replay-pipeline["prisoner"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "step-function-log-group" {
        id                = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-prisoner-production"
        name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-prisoner-production"
      ~ tags              = {
            "Domain"         = "prisoner"
          ~ "Jira"           = "main" -> "DPR2-1857"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
            "name"           = "log-group-dpr-replay-pipeline-nomis-prisoner-production"
        }
      ~ tags_all          = {
          ~ "Jira"           = "main" -> "DPR2-1857"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.replay-pipeline["prisoner-address"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "step-function-log-group" {
        id                = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-prisoner-address-production"
        name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-prisoner-address-production"
      ~ tags              = {
            "Domain"         = "prisoner-address"
          ~ "Jira"           = "main" -> "DPR2-1857"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
            "name"           = "log-group-dpr-replay-pipeline-nomis-prisoner-address-production"
        }
      ~ tags_all          = {
          ~ "Jira"           = "main" -> "DPR2-1857"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.replay-pipeline["prisoner-ed"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "step-function-log-group" {
        id                = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-prisoner-ed-production"
        name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-prisoner-ed-production"
      ~ tags              = {
            "Domain"         = "prisoner-ed"
          ~ "Jira"           = "main" -> "DPR2-1857"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
            "name"           = "log-group-dpr-replay-pipeline-nomis-prisoner-ed-production"
        }
      ~ tags_all          = {
          ~ "Jira"           = "main" -> "DPR2-1857"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.replay-pipeline["prisoner-health"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "step-function-log-group" {
        id                = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-prisoner-health-production"
        name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-prisoner-health-production"
      ~ tags              = {
            "Domain"         = "prisoner-health"
          ~ "Jira"           = "main" -> "DPR2-1857"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
            "name"           = "log-group-dpr-replay-pipeline-nomis-prisoner-health-production"
        }
      ~ tags_all          = {
          ~ "Jira"           = "main" -> "DPR2-1857"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.replay-pipeline["prisoner-profile"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "step-function-log-group" {
        id                = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-prisoner-profile-production"
        name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-prisoner-profile-production"
      ~ tags              = {
            "Domain"         = "prisoner-profile"
          ~ "Jira"           = "main" -> "DPR2-1857"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
            "name"           = "log-group-dpr-replay-pipeline-nomis-prisoner-profile-production"
        }
      ~ tags_all          = {
          ~ "Jira"           = "main" -> "DPR2-1857"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.replay-pipeline["program-profiles"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be created
  + resource "aws_cloudwatch_log_group" "step-function-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-program-profiles-production"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "program-profiles"
          + "Jira"           = "DPR2-1857"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-nomis-program-profiles-production"
        }
      + tags_all          = {
          + "Domain"         = "program-profiles"
          + "Jira"           = "DPR2-1857"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-nomis-program-profiles-production"
        }
    }

  # module.replay-pipeline["program-profiles"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (known after apply)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-replay-pipeline-nomis-program-profiles-production"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = "arn:aws:iam::004723187462:role/dpr-step-function-execution-role"
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "program-profiles"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "program-profiles"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)

      + encryption_configuration (known after apply)

      + logging_configuration {
          + include_execution_data = true
          + level                  = "ERROR"
          + log_destination        = (known after apply)
        }

      + tracing_configuration {
          + enabled = true
        }
    }

  # module.replay-pipeline["questionnaire"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "step-function-log-group" {
        id                = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-questionnaire-production"
        name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-questionnaire-production"
      ~ tags              = {
            "Domain"         = "questionnaire"
          ~ "Jira"           = "main" -> "DPR2-1857"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
            "name"           = "log-group-dpr-replay-pipeline-nomis-questionnaire-production"
        }
      ~ tags_all          = {
          ~ "Jira"           = "main" -> "DPR2-1857"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.replay-pipeline["reference"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "step-function-log-group" {
        id                = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-reference-production"
        name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-reference-production"
      ~ tags              = {
            "Domain"         = "reference"
          ~ "Jira"           = "main" -> "DPR2-1857"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
            "name"           = "log-group-dpr-replay-pipeline-nomis-reference-production"
        }
      ~ tags_all          = {
          ~ "Jira"           = "main" -> "DPR2-1857"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.replay-pipeline["safety"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "step-function-log-group" {
        id                = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-safety-production"
        name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-safety-production"
      ~ tags              = {
            "Domain"         = "safety"
          ~ "Jira"           = "main" -> "DPR2-1857"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
            "name"           = "log-group-dpr-replay-pipeline-nomis-safety-production"
        }
      ~ tags_all          = {
          ~ "Jira"           = "main" -> "DPR2-1857"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.replay-pipeline["sentence"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "step-function-log-group" {
        id                = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-sentence-production"
        name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-sentence-production"
      ~ tags              = {
            "Domain"         = "sentence"
          ~ "Jira"           = "main" -> "DPR2-1857"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
            "name"           = "log-group-dpr-replay-pipeline-nomis-sentence-production"
        }
      ~ tags_all          = {
          ~ "Jira"           = "main" -> "DPR2-1857"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.replay-pipeline["transactions"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "step-function-log-group" {
        id                = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-transactions-production"
        name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-transactions-production"
      ~ tags              = {
            "Domain"         = "transactions"
          ~ "Jira"           = "main" -> "DPR2-1857"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
            "name"           = "log-group-dpr-replay-pipeline-nomis-transactions-production"
        }
      ~ tags_all          = {
          ~ "Jira"           = "main" -> "DPR2-1857"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.replay-pipeline["visits"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "step-function-log-group" {
        id                = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-visits-production"
        name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-nomis-visits-production"
      ~ tags              = {
            "Domain"         = "visits"
          ~ "Jira"           = "main" -> "DPR2-1857"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
            "name"           = "log-group-dpr-replay-pipeline-nomis-visits-production"
        }
      ~ tags_all          = {
          ~ "Jira"           = "main" -> "DPR2-1857"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.setup-dms-endpoints["dps-csip"].module.dms_endpoints.aws_dms_endpoint.dms-s3-target-source[0] will be updated in-place
  ~ resource "aws_dms_endpoint" "dms-s3-target-source" {
        id                              = "dpr-dms-dps-csip-pgres-source-endpoint"
        tags                            = {
            "DMS_Source"     = "dps"
            "Domain"         = "Common"
            "Jira"           = "main"
            "Resource_Type"  = "DMS Source Endpoint"
            "Service_Bundle" = "true"
        }
        # (16 unchanged attributes hidden)

      ~ postgres_settings {
          ~ heartbeat_enable             = true -> false
            # (15 unchanged attributes hidden)
        }
    }

  # module.setup-dms-endpoints["dps-inc-reporting"].module.dms_endpoints.aws_dms_endpoint.dms-s3-target-source[0] will be updated in-place
  ~ resource "aws_dms_endpoint" "dms-s3-target-source" {
      ~ extra_connection_attributes     = (sensitive value)
        id                              = "dpr-dms-dps-inc-reporting-pgres-source-endpoint"
        tags                            = {
            "DMS_Source"     = "dps"
            "Domain"         = "Common"
            "Jira"           = "main"
            "Resource_Type"  = "DMS Source Endpoint"
            "Service_Bundle" = "true"
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 326 to add, 850 to change, 162 to destroy.

```